code_list = [
    # '600143.SH',
    # "000488.SZ",
    # "603566.SH",
    # "000333.SZ",
    '600703.SH'
    # "002415.SZ"
    # "000425.SZ"
]

code_list = [
"603345.SH",	# 安井食品
"603566.SH",	# 普莱柯
"600298.SH",	# 安琪酵母
"600460.SH",	# 士兰微",
"002236.SZ",	# 大华股份
"000885.SZ",	# 城发环境
"002380.SZ",	# 科远智慧
"600104.SH",	# 上汽集团
"003816.SZ",	# 中国广核
"600320.SH",	# 振华重工
"000800.SZ",	# 一汽解放
"601138.SH",	# 工业富联
"000905.SZ",	# 厦门港务
"601766.SH",	# 中国中车
"600690.SH",	# 海尔智家
"600031.SH",	# 三一重工
"601816.SH",	# 京沪高铁
"600703.SH",	# 三安光电
"000100.SZ",	# TCL科技
"002607.SZ",	# 中公教育
"600966.SH",	# 博汇纸业
"000488.SZ",	# 晨鸣纸业
"000651.SZ",	# 格力电器
"000333.SZ",	# 美的集团
"002415.SZ",	# 海康威视
"600597.SH",	# 光明乳业
"000895.SZ",	# 双汇发展
]
code_name = {
	'000100.SZ': 'TCL科技',
	'000157.SZ': '中联重科',
	'000333.SZ': '美的集团',
	'000425.SZ': '徐工机械',
	'000488.SZ': '晨鸣纸业',
	'000651.SZ': '格力电器',
	'000713.SZ': '丰乐种业',
	'000725.SZ': '京东方A',
	'000876.SZ': '新希望',
	'000885.SZ': '城发环境',
	'000895.SZ': '双汇发展',
	'000905.SZ': '厦门港务',
	'000930.SZ': '中粮科技',
	'000962.SZ': '东方钽业',
	'002157.SZ': '正邦科技',
	'002216.SZ': '三全食品',
	'002236.SZ': '大华股份',
	'002352.SZ': '顺丰控股',
	'002380.SZ': '科远智慧',
	'002385.SZ': '大北农',
	'002415.SZ': '海康威视',
	'002423.SZ': '中粮资本',
	'002475.SZ': '立讯精密',
	'002511.SZ': '中顺洁柔',
	'002607.SZ': '中公教育',
	'002648.SZ': '卫星石化',
	'002714.SZ': '牧原股份',
	'003816.SZ': '中国广核',
	'600031.SH': '三一重工',
	'600089.SH': '特变电工',
	'600104.SH': '上汽集团',
	'600143.SH': '金发科技',
	'600298.SH': '安琪酵母',
	'600309.SH': '万华化学',
	'600362.SH': '江西铜业',
	'600406.SH': '国电南瑞',
	'600460.SH': '士兰微',
	'600563.SH': '法拉电子',
	'600585.SH': '海螺水泥',
	'600596.SH': '新安股份',
	'600597.SH': '光明乳业',
	'600598.SH': '北大荒',
	'600690.SH': '海尔智家',
	'600703.SH': '三安光电',
	'600893.SH': '航发动力',
	'600966.SH': '博汇纸业',
	'601138.SH': '工业富联',
	'601618.SH': '中国中冶',
	'601727.SH': '上海电气',
	'601766.SH': '中国中车',
	'601816.SH': '京沪高铁',
	'601899.SH': '紫金矿业',
	'603195.SH': '公牛集团',
	'603345.SH': '安井食品',
	'603515.SH': '欧普照明',
	'603566.SH': '普莱柯'
}