code_list = [
    # '600143.SH',
    # "000488.SZ",
    # "603566.SH",
    # "000333.SZ",
    '600703.SH'
    # "002415.SZ"
    # "000425.SZ"
]

code_list = [
"603345.SH",	# 安井食品
"603566.SH",	# 普莱柯
"600298.SH",	# 安琪酵母
"600460.SH",	# 士兰微",
"002236.SZ",	# 大华股份
"000885.SZ",	# 城发环境
"002380.SZ",	# 科远智慧
"600104.SH",	# 上汽集团
"003816.SZ",	# 中国广核
"600320.SH",	# 振华重工
"000800.SZ",	# 一汽解放
"601138.SH",	# 工业富联
"000905.SZ",	# 厦门港务
"601766.SH",	# 中国中车
"600690.SH",	# 海尔智家
"600031.SH",	# 三一重工
"601816.SH",	# 京沪高铁
"600703.SH",	# 三安光电
"000100.SZ",	# TCL科技
"002607.SZ",	# 中公教育
"600966.SH",	# 博汇纸业
"000488.SZ",	# 晨鸣纸业
"000651.SZ",	# 格力电器
"000333.SZ",	# 美的集团
"002415.SZ",	# 海康威视
"600597.SH",	# 光明乳业
"000895.SZ",	# 双汇发展
]
code_name = {
    "603345.SH":"安井食品",
    "603566.SH":"普莱柯",
    "600298.SH":"安琪酵母",
    "600460.SH":"士兰微",
    "002236.SZ":"大华股份",
    "000885.SZ":"城发环境",
    "002380.SZ":"科远智慧",
    "600104.SH":"上汽集团",
    "003816.SZ":"中国广核",
    "600320.SH":"振华重工",
    "000800.SZ":"一汽解放",
    "601138.SH":"工业富联",
    "000905.SZ":"厦门港务",
    "601766.SH":"中国中车",
    "600690.SH":"海尔智家",
    "600031.SH":"三一重工",
    "601816.SH":"京沪高铁",
    "600703.SH":"三安光电",
    "000100.SZ":"TCL科",
    "002607.SZ":"中公教育",
    "600966.SH":"博汇纸业",
    "000488.SZ":"晨鸣纸业",
    "000651.SZ":"格力电器",
    "000333.SZ":"美的集团",
    "002415.SZ":"海康威视",
    "600597.SH":"光明乳业",
    "000895.SZ":"双汇发展"
}